In [1]:
import numpy as np
import pandas as pd

In [22]:
dataset = pd.read_csv("Dataset/Titanic-Dataset.csv")
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
data = dataset.drop(['PassengerId','Name'], axis = 1)
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
data.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Cabin     204 non-null    object
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [26]:
data.dropna(inplace=True)

In [27]:
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
6,0,1,male,54.0,0,0,17463,51.8625,E46,S
10,1,3,female,4.0,1,1,PP 9549,16.7000,G6,S
11,1,1,female,58.0,0,0,113783,26.5500,C103,S

In [29]:
data.isnull().sum().sum() # return Nan values

0

In [30]:
data['Sex'] = data['Sex'].map({'male':1,"female":0})
data['Embarked'] = data['Embarked'].map({'C':0,'S':1,'Q':2})

In [31]:
data.drop(['Ticket','Cabin'],axis=1,inplace=True)

In [32]:
data.head()

    Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
1          1       1    0  38.0      1      0  71.2833         0
3          1       1    0  35.0      1      0  53.1000         1
6          0       1    1  54.0      0      0  51.8625         1
10         1       3    0   4.0      1      1  16.7000         1
11         1       1    0  58.0      0      0  26.5500         1

In [33]:
X = data.drop(['Survived'],axis = 1)
y = data['Survived']

X.shape, y.shape

((183, 7), (183,))

In [34]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_scaled = scaler.fit_transform(X)

In [35]:
X_scaled.shape

(183, 7)

In [36]:
from sklearn.model_selection import train_test_split

X_train,X_test,y_train,y_test = train_test_split(X_scaled,y,test_size=0.3, random_state=42)

print(f"Train {X_train.shape} {y_train.shape}")
print(f"Test {X_test.shape} {y_test.shape}")

Train (128, 7) (128,)
Test (55, 7) (55,)

In [38]:
from keras.models import Sequential
from keras.layers import Dense,Input

In [39]:
model = Sequential([
    Input(shape = (X_train.shape[1],)),
    Dense(128, activation = 'relu'),
    Dense(64, activation = 'relu'),
    Dense(1, activation = 'sigmoid')
])
model.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 128)               1024
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65
=================================================================
Total params: 9,345
Trainable params: 9,345
Non-trainable params: 0
_________________________________________________________________

In [40]:
model.compile(optimizer='adam', loss = 'binary_crossentropy', metrics=['accuracy'])

In [41]:
history = model.fit(X_train, y_train, epochs = 10, validation_data = (X_test,y_test))

Epoch 1/10
4/4 [==============================] - 3s 628ms/step - loss: 0.6846 - accuracy: 0.5354 - val_loss: 0.6594 - val_accuracy: 0.6182
Epoch 2/10
4/4 [==============================] - 0s 42ms/step - loss: 0.6396 - accuracy: 0.6271 - val_loss: 0.6317 - val_accuracy: 0.6364
Epoch 3/10
4/4 [==============================] - 0s 70ms/step - loss: 0.5971 - accuracy: 0.7125 - val_loss: 0.6063 - val_accuracy: 0.6364
Epoch 4/10
4/4 [==============================] - 0s 31ms/step - loss: 0.5771 - accuracy: 0.6865 - val_loss: 0.5846 - val_accuracy: 0.6727
Epoch 5/10
4/4 [==============================] - 0s 34ms/step - loss: 0.5304 - accuracy: 0.7510 - val_loss: 0.5661 - val_accuracy: 0.7273
Epoch 6/10
4/4 [==============================] - 0s 30ms/step - loss: 0.4895 - accuracy: 0.7844 - val_loss: 0.5466 - val_accuracy: 0.7273
Epoch 7/10
4/4 [==============================] - 0s 33ms/step - loss: 0.4796 - accuracy: 0.7865 - val_loss: 0.5301 - val_accuracy: 0.7455
Epoch 8/10
4/4 [==============================] - 0s 33ms/step - loss: 0.4516 - accuracy: 0.7958 - val_loss: 0.5173 - val_accuracy: 0.7818
Epoch 9/10
4/4 [==============================] - 0s 33ms/step - loss: 0.4041 - accuracy: 0.8052 - val_loss: 0.5085 - val_accuracy: 0.7818
Epoch 10/10
4/4 [==============================] - 0s 34ms/step - loss: 0.4248 - accuracy: 0.7948 - val_loss: 0.5010 - val_accuracy: 0.7818

In [42]:
model.evaluate(X_test,y_test,verbose=1)

2/2 [==============================] - 0s 4ms/step - loss: 0.5010 - accuracy: 0.7818

[0.5009959936141968, 0.7818182110786438]